{"license":"MIT","file_hash":null,"name":"Data-Shapes","version":"2026.4.0","description":"This Version of Data Shapes now works with CPython, no need for the IronPython package. Collection of nodes that aims to enhance the interaction with revit and UI creation for dynamo scripts . Check out www.data-shapes.io for more informations about the nodes, tutorials and workflows! UI Nodes now usable in Civil 3D, sandbox and Formit environments as well!!","group":"","keywords":["ui","shared","parameters","bim","management","revit","api","architecture"],"dependencies":[],"host_dependencies":["Revit","Civil 3D","CPython3","IronPython2"],"contents":"ActiveDocument.FileSize - Gets the file size of the ative document, even if it is a BIM360 Design workshared project., ActiveDocument.Name - Gets the name of the active document, Add Shared Parameter(s) from txt - Add shared parameters to project from SharedParameter .txt file, All Elements In View(s) - Retrieves all visible element in a view or a set of views, All Elements Of Categories in View - Retrieves all elements of the given categories in the given view, All Lines of LineStyle - Gets all lines in a project with a giver LineStyle, BarChart - BarChart, Boolean input - Creates a boolean input for UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more infos!, Categorie(s) by ENU Name(s) - Gets categorie(s) in the current UI language by it\u0027s english name, Categories list - Gives list of all Revit categories and a matching list of their names, ColorInput Data - Create a color selection input for UI.MultiInputForm\u002B\u002B . Check out www.data-shapes.net for more infos! Warning : Only works with Revit 2017, ConditionalInput Data - Allows to create inputs that are enabled/disabled by a condition dor UI.MultipleInputForm\u002B\u002B. , DataTable input - Create a DataTable view input for UI.MultipleInputForm \u002B\u002B, DirectoryPath Data - Creates a DirectoryPath input for UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more infos!, Document.LengthDisplayUnit - Returns diplay units for lengths in current document., DropDown Data - Create data for DropDown input in UI.MultiInputForm \u002B\u002B . Check out www.data-shapes.net for more infos., Duplicate Element - Duplicates all types of elements including view templates, Element(s) cut - Cutting element(s) with element, Excel.Worksheets - Gets worksheet names from specified Excel workbook., Export to FBX - Exports 3D views to FBX format, Export Views to NavisWorks - exports 3d views to NavisWorks, FilePath Data - Create filepath input for UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more infos !, Filter.IsApplied - Returns a boolean values indicating wether a ParameterFilterElement is applied to any view in the project or not. , Geometry.PruneDuplicates - Removes all duplicate geometries from list., Get All Linked Docs infos - Get all linked documents names and paths, GetAllElementsFromLinks\u002B\u002B - Get all elements of category or type from given documents , GetLinkedElement.InHostView - Gets linked elements in host view(s)., GetLinkedElement.InHostViewAndCategory - Gets linked elements in host view, filtered by category., Grid.SetVerticalExtents - Set the vertical extents of all project grids, Image Data - Places an image on UI.MultipleInutForm \u002B\u002B ., ImportInstance.IsLinked - Returns boolean info indicating wether an ImportInstance is linked or not (meaning it\u0027s imported)., InputGroup Data - Creates a group of inputs for UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more infos !, Line LineStyle - Gives LineStyle name and element of Lines, LineChart - LineChart, Listview Data - Create data for ListView input in UI.MultiInputForm \u002B\u002B . Check out www.data-shapes.net for more infos., ModificationTracker.AllChanges - Takes ExistingElements Data as input and outputs lists with all geometry/parameter values change combinations . Check out www.Data-Shapes.net for more informations ., ModificationTracker.GeometryChanges - Takes ExistingElements Data as input and outputs elements with same geometry and elements with changed geometry . Check out www.Data-Shapes.net for more infos, ModificationTracker.ModelComparison - Compares elements from documents A and B (A is the current document by default) and returns existing elements data, new elements, deleted elements and a report. Check out www.Data-Shapes.net for more infos. , ModificationTracker.ParameterChanges - takes ExistingElements Data as input and outputs elements with same parameter values and elements with changed parameter values. Check out www.Data-Shapes.net for more infos., MultiLanguage IO - Takes inputs in different languages and returns the version that corresponds to the active Revit application language settings., MultiLineTextBox Data - Creates a multi line textbox input for UI.MultipleInputForm \u002B\u002B, MultipleInputForm \u002B\u002B - Create a form with multiple inputs. \r\nsee www.data-shapes.net for tutorials and infos!, Number to Rounded String  - Returns rounded number to specified number of decimals as string, ParameterGroup list - List of all parameter groups, PerformanceAdviserRule Elements - Gets all elements relative to a performance adviser rule. , PerspectiveView.ByEyePositionTarget - Create perspective view , PieChart - PieChart, PointChart - PointChart, RadioButtons Data - Create radio buttons input for UI.MultipleInputForm \u002B\u002B . , RayBounce On Link Category - Same functionality as raybounce but takes linked model elements into account, RayBounce On Linked Model - Same functionality as raybounce but takes linked model elements into account, Replace viewports by center - Replaces vieports on sheets according to list of points. (0,0) is bottom left of sheets, Room Status - Sorts a list of room into three categories: unplaced, PlacedAndBounded and  unbounded, Room.Height - Returns room height., Room_Group_Outline - Returns the outline of the inpu rooms, grouped by the value of the \u0022Grouping Parameter\u0022, Select Face (s) (PickObject) - Same as OOTB Select Faces, but can be used through Dynamo Player, Select Model Elements of Category - Allows to perform a manual selection with a category filter., SelectAutoCadObjects_Data - This input can be used in Civil 3D or in Autocad for object selection! , SelectEdges Data - Creates a Revit edge selection input for UI.MultipleInputForm\u002B\u002B . Check out www.data-shapes.net for more infos! , SelectFaces Data - Creates a Revit face selection input for UI.MultipleInputForm\u002B\u002B. Check out www.data-shapes.net for more infos!, SelectLinkedElement(s) Data - Create a button input for UI.MultipleInputForm\u002B\u002B that allows to select elements in à linked document. See www.data-shapes.net for more infos!, SelectModelElements Data (ordered) - Creates a Revit element selection input for UI.MultipleInputForm\u002B\u002B . Check out www.data-shapes.net for more infos!, SelectModelElements Data - Creates a Revit element selection input for UI.MultipleInputForm\u002B\u002B . Check out www.data-shapes.net for more infos!, SelectPointsOnFace data - Creates a UI.MultipleInputForm\u002B\u002B input that allows point on face selection , Set Active Family Parameter By Name - Set a parameter inside an active family document, SetCropRegion - Sets the crop region of a view to a closed polycurve., SharedParameters from txt file - Gets parameters from SharedParameter .txt file, SheetTitleblock - Get the TitleBlock family type from a sheet, Sheet_Titleblock - Gets the titleblock used in a Sheet, SlabShape.AddPoints - Add points to slab shape, SlabShape.AddSplitLine - Adds split lines to Revit Floors, Slider - Creates slider input for UI.MultipleInputForm \u002B\u002B . Set the step to decimal value if you want a double slider, or to a integer value if you want an integer slider. , SplineChart - SplineChart, TextBox Data - Create Data for TextBox input in UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more informations, TextNote Data - Create Data for TextNote input in UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more informations, Transform.OriginAndVectors - Gets origin and vetorx of Autodesk.Revit.DB.Transform objects, TreeView input - Create a TreeView input for UI.MultipleInputForm \u002B\u002B . Check out www.data-shapes.net for more infos and tips!, View.ViewRange - Returns the view range data of a view, ViewLevel - gets the level that a view is associated to, ViewportLocation\u002B\u002B - Gets the location point of a viewport or a ScheduleSheetInstance, ViewSection.ByLine - Create ViewSections in current document from DS Lines. , ViewTemplate.IsApplied - Returns a boolean value indicating wether a ViewTemplate is applied to any view in the project or not. This won\u0027t work for 3D templates. , WallSweepOnWall - Creates a wallsweep or reveal on a wall","engine_version":"3.3.0.6316","engine":"dynamo","engine_metadata":"","site_url":"www.data-shapes.io","repository_url":"https://github.com/MostafaElAyoubi/Data-shapes","contains_binaries":true,"node_libraries":["DataShapesUI, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null","DataShapesZT, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null","Package.customization, Version=0.0.0.0, Culture=neutral, PublicKeyToken=null"],"copyright_holder":"mostafa.elayoubi.ds","copyright_year":"2024"}